# -*-coding = utf-8 -*-
'''
题目：
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，
高于100万元时，超过100万元的部分按1%提成，
从键盘输入当月利润I，求应发放奖金总数？
'''

"""
函数说明:条件判断计算奖金
Parameters:利润（x）
Returns:奖金（jq）
Modify:2019-01-09
"""
def jiangjing(x):
	if x <= 10:
		jq = x * 0.1
	elif x < 20:
		jq = 10 * 0.1 + (x - 10) * 0.075
	elif x < 40:
		jq = 10 * 0.1 + 10 * 0.075 + (x - 20) * 0.05
	elif x < 60:
		jq = 10 * 0.1 + 10 * 0.075 + 20 *0.05 + (x - 40) * 0.03
	elif x < 100:
		jq = 10 * 0.1 + 10 * 0.075 + 20 *0.05 + 20 * 0.03 + (x - 60) * 0.015
	else:
		jq = 10 * 0.1 + 10 * 0.075 + 20 *0.05 + 20 * 0.03 + 40 * 0.015 + (x - 100) * 0.001
	return jq

def jiangjing2(i,AL1,AL2):
	jq = 0
	L1, L2 = AL1, AL2
	for x in range(len(AL1)):
		if i > AL1[x]:
			jq += (i - AL1[x])*AL2[x]
			i = AL1[x]
	return jq

if __name__ == '__main__':
	x = int(input('利润：'))
	jj = jiangjing(x)
	print(jj)
	AL1 = list([100,60,40,20,10,0])
	AL2 = list([0.01,0.015,0.03,0.05,0.075,0.1])
	jj2 = jiangjing2(x, AL1, AL2)
	print(jj2)